//=========================================================
/*
		대입 연산자 ( =, +=, -=, *=, /=, %=, &=, |=, ^= )
		
		-	오른쪽 피연산자의 값을
		 	왼쪽 피연산자인 변수에 저장..
		 	
		 	ㄴ	왼쪽 피연산자..
		 		( L-Value.. )
		 		
		 		ㄴ	변수..
		 		
		 	ㄴ	오른쪽 피연산자..
		 		( R-Value.. )
		 		
		 		ㄴ	변수, 상수, 연산식 등..
		 		
		 		
		 		
		 -	대인 연산자의 종류..
		 
		 	================================================
		 	구분..			|	연산식..	|	설명..
		 	================================================
		 	단순 대입 연산자..	|	A = B	|	A에 B의 값을 전달..
		 	------------------------------------------------
		 					|	A += B	|	A = A + B
		 	복합 대입 연산자..	|-------------------------------
		 					|	A -= B	|	A = A - B
		 					|			|
		 					|	.....	|
		 	================================================
		 	
		 	
		 -	대입 연산자는 모든 연산자들 중
		  	가장 낮은 연산순위를 가짐..
		  	
		  	ㄴ	제일 마지막에 수행 됨..
		  	
		  	
		-	연산의 진행방향..
		 
		 	ㄴ	<----..
		 	
		 		예)	a = b = c = 100;
		 		
		 			1)	c = 100;
		 			2) 	b = c;
		 			3)	a = b;
		 			
*/
//=========================================================
package sector03.exam01;
//=========================================================
public class AssignmentOperator_Test {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		int res = 0;
		
		res += 10;
		System.out.println("res = " + res);
		
		res -= 5;
		System.out.println("res = " + res);
		
		res *= 3;
		System.out.println("res = " + res);
		
		res /= 5;
		System.out.println("res = " + res);
		
		res %= 3;
		System.out.println("res = " + res);
	

	}

}
//=========================================================